# 컴퓨터에서 사용되는 진법
#                     C언어    Python
# 2진수 0,1            X       0b10
# 8진수 0~7            010     0o10
# 10진수 0~9            10      10
# 16진수 0~9,A~F        0x10    0x10

# 컴퓨터에서는 기계어를 사용하기 때문에
# 정수는 2 진수로 변환되어 저장된다
# **출력 형식은 기본 10 진법(10 진수) 로 출력이 된다.

print(0b10)
print(0o10)
print(10)
print(0x10)

print(0b10101010)
print(0o2734)
print(0x5AB)

# 진법 변환 함수
# - bin : 2진수 변환 함수
# - oct : 8진수 변환 함수
# - hex : 16진수 변환 함수

print(bin(1500))
print(oct(1500))
print(hex(1500))
















